# SQL Parte 2:

## Objetivos:
    1. Conectarnos a una base de datos desde Python.
    2. Enviar un query a la base de datos y exportarlo como un dataframe de pandas.
    3. Introducción a joins entre tablas.
        3.1 Teoría de Conjuntos
        3.2 Joins.
    4. Consideraciones: Subqueries. 
    
 
 
 ### 1. Conectarnos a una base de datos desde Python. 
     
En las sesiones anteriores, emulamos la conexión a una base de datos relacional importando un csv. En esta ocasión, utilizaremos el datasest _pseudo-real_ de employees. Este dataset se ha utilizado para pruebas de _benchmarking_ tanto en análisis como en desempeño.  Nosotros lo utilizaremos para establecer una conexión remota y para introducir algunas consideraciones sobre cómo hacer que nuestros queries sean más eficientes.

Pueden encontrar más información del mismo acá: 

https://relational.fit.cvut.cz/dataset/Employee
https://www.percona.com/blog/2011/02/01/sample-datasets-for-benchmarking-and-testing/

Para realizar esta conexión, utilizaremos la librería *mysql.connector*, la cual pueden instalar en el ambiente del curso por medio de Anaconda.

In [1]:
import pandas as pd

Creamos una función la cual tendrá como parámetros lo necesario para poder establecer la conexión al SQL:

In [14]:
import mysql.connector
from mysql.connector import Error

def create_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [15]:
host = "relational.fit.cvut.cz"
user = "guest"
pwd = "relational"
connection = create_connection(host_name = host, user_name =user ,user_password = pwd)

Connection to MySQL DB successful

### 2. Enviar un query a la base de datos y obtenerlo como un dataframe de Pandas:

    Utilizaremos la función read_sql de pandas para obtener los resultados de nuestros querys:

In [4]:
query = "SHOW TABLES from employee;"
tables = pd.read_sql(query,connection)
tables

  Tables_in_employee
0        departments
1           dept_emp
2       dept_manager
3          employees
4           salaries
5             titles

In [ ]:
query = "select * from employee.employees limit 10;"
employees = pd.read_sql(query,connection)

In [ ]:
employees

In [ ]:
query = "select * from employee.salaries limit 10;"
salaries = pd.read_sql(query,connection)
salaries

In [ ]:
query = "select * from employee.titles limit 10;"
titles = pd.read_sql(query,connection)
titles

In [ ]:
query = "select * from employee.departments limit 10;"
departments = pd.read_sql(query,connection)
departments

In [ ]:
query = "select * from employee.dept_emp limit 10;"
dept_emp = pd.read_sql(query,connection)
dept_emp

### 3. Introducción a Joins entre tablas:

#### Teoría de conjuntos: 
    Conjunto: 
        -Una colección de distintos elementos (Tsitsiklis).
        -Una agrupación, colección o reunión de objeto que cumplen una propiedad determinada.
    
    A los objetos del conjunto se denominan elementos. 
    
    
#### Ejemplos:
    1. El conjunto de estudiantes de data wrangling.
    2. El conjunto de letras de "data wrangling". 
    
#### Notación: 
    Los conjuntos se denotan con letras mayúsculas del alfabeto. Los elementos se escriben dentro de llaves.
    
    A = El conjunto de estudiantes de data wrangling. 
    B = El conjunto de letras de "data wrangling".
    
#### Determinación de conjuntos: 
    Extensión: se enumeran o se nombran los elementos del conjunto.
        B = {d,a,t,w,r,n,g,l} 
    Comprensión: Se enuncia la propiedad o la cualidad que distingue a los elementos.
        B = {x/ x es una letra de las palabras "data wrangling"}
    

#### Conjuntos especiales

        Conjunto vacío: aquel en el que ningún elemento cumple con la propiedad conocida como la regla de elegibilidad. 
        (Para cada familia de conjuntos, existe otro conjunto que contiene un elemento de cada uno de aquellos.)

    (Ver axioma de existencia) 

#### Propiedades de los conjuntos 

<img src="set_theory.png" />

- La intersección de conjuntos es conmutativa.
- La intersección de conjuntos es asociativa. 
- La intersección es distributiva respecto a la unión.
- La unión es distributiva respecto a la intersección.
- La unión de un conjunto con el universo es el universo.
- La intersección de un conjunto con su complemento es el conjunto vacío.



#### Joins entre tablas. 

Una de las aplicaciones más palpables de teoría de conjuntos en la ciencia de datos (aparte de teoría de probabilidad) es en manipulación y union entre sets de datos. De cierta manera, podemos pensar en nuestras colecciones de datos como conjuntos de elementos que comparten ciertas características en común. Sin embargo, estas características están dispersas en varias fuentes de información y parte previa al análisis es el proceso de consolidación, por lo cual se vuelve necesario realizar operaciones de conjuntos con ellos. 

Para esto, utilizaremos las keywords JOIN de SQL.


<img src="joins.jpg" />

### Ejemplo 1: A cada empleado, agregarle todos sus títulos y su vigencia.

In [6]:
%%time
### empleados y títulos 
query = """ SELECT
                A.emp_no,
                A.first_name,
                A.last_name,
                B.title,
                B.from_date,
                B.to_date
         FROM employee.employees A  
         LEFT JOIN employee.titles B on A.emp_no = B.emp_no
         WHERE A.emp_no = 11080
"""
emp_titles = pd.read_sql(query,connection)
emp_titles

CPU times: user 158 ms, sys: 86.7 ms, total: 245 ms
Wall time: 2.73 s

   emp_no first_name last_name            title   from_date     to_date
0   11080     Sanjai     Puppe         Engineer  1988-07-04  1993-07-04
1   11080     Sanjai     Puppe  Senior Engineer  1993-07-04  9999-01-01

### Ejercicio 1: 

Obtener el nombre, apellido,salario, titulo y vigencia del mismo para el empleado 12557. 
Su resultado se debe de ver de la siguiente manera:

<img src="ejercicio_1.png" />

In [16]:
query = """SELECT
                A.emp_no,
                A.first_name,
                A.last_name,
                B.title,
                C.from_date,
                C.to_date,
                C.salary
         FROM employee.employees A  
         LEFT JOIN employee.titles B on A.emp_no = B.emp_no 
         LEFT JOIN employee.salaries C on A.emp_no = C.emp_no
         WHERE A.emp_no = 12557
"""
emp_12557 = pd.read_sql(query,connection)
emp_12557

,emp_no,first_name,last_name,title,from_date,to_date,salary
0,12557,Stafford,Kopetz,Senior Engineer,1988-03-20,1989-03-20,41840
1,12557,Stafford,Kopetz,Senior Engineer,1989-03-20,1990-03-20,46021
2,12557,Stafford,Kopetz,Senior Engineer,1990-03-20,1991-03-20,48699
3,12557,Stafford,Kopetz,Senior Engineer,1991-03-20,1992-03-19,51610
4,12557,Stafford,Kopetz,Senior Engineer,1992-03-19,1993-03-19,51351
5,12557,Stafford,Kopetz,Senior Engineer,1993-03-19,1994-03-19,51660
6,12557,Stafford,Kopetz,Senior Engineer,1994-03-19,1995-03-19,52878
7,12557,Stafford,Kopetz,Senior Engineer,1995-03-19,1996-03-18,54053
8,12557,Stafford,Kopetz,Senior Engineer,1996-03-18,1997-03-18,57950
9,12557,Stafford,Kopetz,Senior Engineer,1997-03-18,1998-03-18,58055
10,12557,Stafford,Kopetz,Senior Engineer,1998-03-18,1999-03-18,58863
11,12557,Stafford,Kopetz,Senior Engineer,1999-03-18,2000-03-17,60447
12,12557,Stafford,Kopetz,Senior Engineer,2000-03-17,2001-03-17,60959
13,12557,Stafford,Kopetz,Senior Engineer,2001-03-17,2002-03-17,62951
14,12557,Stafford,Kopetz,Senior Engineer,2002-03-17,9999-01-01,64554

## Subqueries

### Ejemplo 2: Obtener el salario máximo por empleado.

### Paso 1: Armar un query con el salario máximo por empleado.

In [ ]:
%%time
query = """
        SELECT
            emp_no
            ,MAX(salary) max_salary
        FROM employee.salaries
        GROUP BY 1
        LIMIT 100
        """
inner_table =pd.read_sql(query,connection)

### Paso 2: Estructura general de un subquery

In [ ]:
####

query = """
        SELECT 
        B.first_name
        ,B.last_name, 
        A.* 
        FROM (#inner_table) A
        LEFT JOIN employee.employees B on A.emp_no = B.emp_no 
        """
subquery = pd.read_sql(query,connection)

### Ejercicio 2: Encontrar el último departamento en el que trabajó el empleado con la información del mismo.

In [ ]:
%%time
query = """

"""
pd.read_sql(query,connection)

### Partition By

In [ ]:
query = """
    SELECT
            A.emp_no
            ,A.birth_date
            ,A.first_name
            ,A.last_name
            ,A.gender
            ,C.dept_name
            ,ROW_NUMBER() OVER (PARTITION BY A.emp_no ORDER BY B.from_date DESC) AS seq
        FROM employee.employees A
        LEFT JOIN employee.dept_emp B ON B.emp_no = A.emp_no
        LEFT JOIN employee.departments C ON C.dept_no = B.dept_no
        GROUP BY 1,2,3,4,5,6
        LIMIT 100
"""
pd.read_sql(query,connection)

In [ ]:
%%time
query = """
    SELECT *
    FROM (
        SELECT
            A.emp_no
            ,A.birth_date
            ,A.first_name
            ,A.last_name
            ,A.gender
            ,C.dept_name
            ,ROW_NUMBER() OVER (PARTITION BY A.emp_no ORDER BY B.from_date DESC) AS seq
        FROM employee.employees A
        LEFT JOIN employee.dept_emp B ON B.emp_no = A.emp_no
        LEFT JOIN employee.departments C ON C.dept_no = B.dept_no
        GROUP BY 1,2,3,4,5,6
    ) A
    WHERE seq = 1
    LIMIT 100
"""
pd.read_sql(query,connection)

### Ejercicio 3: Encontrar el salario máximo utilizando el Partition By

In [ ]:
query = """

"""
pd.read_sql(query,connection)

### CASE WHEN

In [ ]:
%%time
query = """
    SELECT
        YEAR(birth_date)
        ,SUM(CASE WHEN gender = 'M' THEN B.salary END) as Male_Salary
        ,SUM(CASE WHEN gender = 'F' THEN B.salary END) as Female_Salary
    FROM employee.employees A
    LEFT JOIN employee.salaries B ON B.emp_no = A.emp_no
    GROUP BY 1
"""
pd.read_sql(query,connection)

### Ejercicio 4: Usando la tabla del máximo salario, encontrar la suma de salarios por departamentos

In [ ]:
%%time
query = """

"""
pd.read_sql(query,connection)